
const winners = [
    {
        "title": "📖 Курьянович Елизавета (11 'А') + Ирина Григорьевна Кокоз – Похвальный отзыв на городском этапе республиканской олимпиады по немецкому языку!",
        "text": "– Как проходила подготовка к олимпиаде? – Мы регулярно готовились с Ириной Григорьевной на каникулах и во время четверти, прорабатывали письменные и устные задания прошлых лет.",
        "img": "assets/olimp/photo_2025-02-12_20-37-34.jpg"
    },
    {
        "title": "📖 Шаманков Даниил (9 'В') + Михаил Николаевич Половцев – Диплом 🥉 степени на городском этапе республиканской олимпиады по немецкому языку!",
        "text": "– Как проходила подготовка к олимпиаде? – Я занимался с учителем в течение четверти и на зимних каникулах, а также самостоятельно.",
        "img": "assets/olimp/photo_2025-02-12_20-37-40.jpg"
    },
    {
        "title": "Дацюк Ирина (11 'А') + Ирина Григорьевна Кокоз – Диплом 🥉 степени на городском этапе республиканской олимпиады по немецкому языку!",
        "text": "– Какое задание было самым сложным? – Самым сложным для меня было задание с пропусками, где нужно было вставить по смыслу глаголы, так как большинство из этих слов мне было неизвестно.",
        "img": "assets/olimp/photo_2025-02-12_20-37-41.jpg"
    },
    {
        "title": "📖 Мацеральник Вера (9 'В') + Михаил Николаевич Половцев – Диплом 🥉 степени на городском этапе республиканской олимпиады по немецкому языку!",
        "text": "– Что тебе помогло одержать победу на олимпиаде? – Уверенность в своих знаниях, хороший завтрак, хорошая подготовка и позитивное настроение.",
        "img": "assets/olimp/photo_2025-02-12_20-37-42.jpg"
    },
    {
        "title": "📖 Подолинский Ян (11 'А') + Ирина Григорьевна Кокоз – Диплом 🥈 степени на городском этапе республиканской олимпиады по немецкому языку!",
        "text": "– Какое задание было самым интересным для тебя? – Работа с текстом: вставить подходящие по смыслу слова и выбрать правильные ответы на вопросы.",
        "img": "assets/olimp/photo_2025-02-12_20-37-44.jpg"
    }
]

const reviews = [
    {
        "name": "Елизавета, 11 класс",
        "text": "На уроках немецкого языка мы осваиваем грамматику, лексику и произношение. Звучит не очень весело, но учитель делает процесс обучения увлекательным и эффективным, использует разнообразные методики, включая игры, диалоги и аудиоматериалы, чтобы развить навыки общения на немецком языке, всегда поддерживает учеников, объясняя сложные темы простым и доступным языком. Профессионализм учителя вдохновляет на достижение высоких результатов.",
        "img": "assets/images/stud1.jpg"
    },
    {
        "name": "Давид, 11 класс",
        "text": "Наши учителя немецког играют важную роль в моем обучении. Они создают дружелюбную и поддерживающую атмосферу на уроках, что помогает чувствовать себя уверенно и комфортно. Их профессионализм и увлеченность предметом вдохновляют меня на новые достижения. Учителя всегда готовы предоставить дополнительные материалы, чтобы углубить мои знания, и отвечают на все мои вопросы. Не менее важным, что учителя разрабатывают индивидуальные планы подготовки, учитывая мои сильные и слабые стороны.",
        "img": "assets/images/stud8.jpg"
    },
    {
        "name": "Настасья, 7 класс",
        "text": "Уроки немецкого языка всегда проходят весело и интересно именно потому, что учитель использует разные методы преподавания, уделяет много времени подготовке к нашим урокам и если что-то не понятно, то всегда объяснит и поможет. Немецкий язык -  мой любимый предмет, ведь уроки никогда не бывают скучными! Уроки немецкого языка приносят мне радость и удовлетворение. Каждый новый урок — это маленькое приключение, которое помогает мне становиться лучше и умнее.",
        "img": "assets/images/stud11.jpg"
    },
    {
        "name": "Ростислав, 5 класс",
        "text": "Мне нравятся учителя немецкого языка. Они строгие, но это помогает мне в учёбе. Уроки проходят всегда интересно и увлекательно.",
        "img": "assets/images/stud12.jpg"
    },
    {
        "name": "Ярослав, 5 класс",
        "text": "Я люблю учить немецкий. С нашим учителем мы узнаём много нового и интересного.",
        "img": "assets/images/stud2.jpg"
    },
    {
        "name": "Ян, 3 класс",
        "text": "Немецкий язык — это не просто уроки, это приключение! Я никогда не думал, что немецкий может быть таким интересным!",
        "img": "assets/images/stud7.jpg"
    },
    {
        "name": "Надежда, 10 класс",
        "text": "Уроки немецкого языка всегда интересные и познавательные. Учитель находит подход к каждому ученику и может сделать так, что даже самую сложную тему мы всегда сможем усвоить и выучить. Практика разговорной речи помогает мне становиться увереннее в общении с людьми из разных стран, улучшает мою способность выражать свои мысли и эмоции на иностранном языке.Это незаменимый опыт, который пригодится как в личной, так и в профессиональной жизни.",
        "img": "assets/images/stud6.jpg"
    },
    {
        "name": "Кира, 10 класс",
        "text": "На уроках немецкого языка мне больше всего нравится разговорная практика. Учитель каждый урок говорит с нами только на немецком. Уроки всегда насыщены новыми фактами , которые делают изучение языка ещё увлекательнее. Учитель объясняет всё очень понятно и доступно. У неё есть индивидуальный подход к каждому ученику, что помогает разобраться даже в самых сложных темах. Атмосфера на уроках всегда комфортная и дружелюбная.",
        "img": "assets/images/stud10.jpg"
    },

    {
        "name": "Анастасия, 4 класс",
        "text": "Уроки немецкого языка всегда интересны и познавательны. На них всегда много новой и важной информации. Несмотря на то, что немецкий язык достаточно сложный, все его правила и особенности учитель объясняет понятно и очень интересно. Каждый урок открывает для меня новые знания в немецком языке. Учитель постоянно нас  поддерживает перед сложными работами или конкурсами. На уроках всегда комфортная обстановка и много весёлых моментов. Мне точно повезло с учителем!",
        "img": "assets/images/stud9.jpg"
    }
]

const Study_Materials = [
    {
        "link": "https://lingvo.adu.by/course/index.php?categoryid=3",
        "text": "LINGVO: Все курсы"
    },
    {
        "link": "https://de_ct.reshu.by/methodist",
        "text": "«РЕШУ ЦТ»: немецкий язык. ЦТ — 2025: за­да­ния, от­ве­ты, ре­ше­ния. Под­го­тов­ка к ЦТ. "
    },
    {
        "link": "https://www.duden.de/woerterbuch",
        "text": "Wörterbuch der deutschen Sprache ✒️ Duden Online"
    },
    {
        "link": "http://sch73.minsk.edu.by/ru/main.aspx?guid=87801",
        "text": "Методические разработки учебных занятий, видеоуроки © Средняя школа №73 г. Минска имени М.Ф.Шмырева"
    }
]

const Scenarios = [
    {
        "name": "3 класс",
        "content": [
            {
                name: "На уроке",
                link: "https://docs.google.com/document/d/1RkNLcEHZdc46smy_Upb7B-RO-qL2iHhI/edit?usp=sharing&ouid=108181189655370107821&rtpof=true&sd=true"
            }
        ]
    },
    {
        "name": "6 класс",
        "content": [
            {
                name: "Чтение открывает границы",
                link: "https://docs.google.com/document/d/1VkrFXYtfM6yoIomEf78p6RmHvSppSRxm/edit?usp=sharing&ouid=108181189655370107821&rtpof=true&sd=true"
            },
            {
                name: "Сколько стоит",
                link: "https://docs.google.com/document/d/1fCoQgPhip1Y4Hcbup-mjIF_BXi-PMXPr/edit?usp=sharing&ouid=108181189655370107821&rtpof=true&sd=true"
            }
        ]
    },
    {
        "name": "7 класс",
        "content": [
            {
                name: "Мой лучший друг",
                link: "https://docs.google.com/document/d/1rSx-C6bEbjh3tzH5iebUZ-TYP7dDnbWP/edit?usp=sharing&ouid=108181189655370107821&rtpof=true&sd=true"
            }
        ]
    },
    {
        "name": "8 класс",
        "content": [
            {
                name: "Идём в кино",
                link: "https://docs.google.com/document/d/1Og_OLIsLDiC1iHN3tYuB8ixqptNdRHZk/edit?usp=sharing&ouid=108181189655370107821&rtpof=true&sd=true"
            }
        ]
    },
    {
        "name": "9 класс",
        "content": [
            {
                name: "Советы и помощь в изучении иностранного языка",
                link: "https://docs.google.com/document/d/1d8-C8uLrNTJ7dR6z65XvwkqecxWkunb3/edit?usp=sharing&ouid=108181189655370107821&rtpof=true&sd=true"
            },
            {
                name: "Рекомендации при выборе профессии",
                link: "https://docs.google.com/document/d/1v9ACQtY7feZ20tpINb5DUIIMLHcLqldG/edit?usp=sharing&ouid=108181189655370107821&rtpof=true&sd=true"
            },
            {
                name: "Зима в Германии и Беларуси",
                link: "https://docs.google.com/document/d/11TmQWLZWUr81nfGkP6Go_v24D-W1t7tB/edit?usp=sharing&ouid=108181189655370107821&rtpof=true&sd=true"
            },
            {
                name: "Природные катаклизмы",
                link: "https://docs.google.com/document/d/16gN6IriE6Hg_tubk3O1w2zwn4r0LFU7I/edit?usp=sharing&ouid=108181189655370107821&rtpof=true&sd=true"
            }
        ]
    },
    {
        "name": "10 класс",
        "content": [
            {
                name: "Природа Беларуси. Беловежская пуща",
                link: "https://docs.google.com/document/d/1r7mXQc-sQBdRngU1ijtf0LfNvVINf6vw/edit?usp=sharing&ouid=108181189655370107821&rtpof=true&sd=true"
            },
            {
                name: "Традиции и особенности нашей школы",
                link: "https://docs.google.com/document/d/1r9yQCnnq_cHcPvkmYuZ_pb1EMSDp8vb1/edit?usp=sharing&ouid=108181189655370107821&rtpof=true&sd=true"
            }
        ]
    },
    {
        "name": "11 класс",
        "content": [
            {
                name: "Выбор профессии",
                link: "https://docs.google.com/document/d/1mSn4bHktmZYEzOpOVXopyuXnZOtN0-Ac/edit?usp=sharing&ouid=108181189655370107821&rtpof=true&sd=true"
            },
            {
                name: "Виды путешествия",
                link: "https://docs.google.com/document/d/1Un81lZizJAFtHbdDmrp2-tNa3UOWWQeo/edit?usp=sharing&ouid=108181189655370107821&rtpof=true&sd=true"
            },
            {
                name: "Типология семьи",
                link: "https://docs.google.com/document/d/1ou-EB3uMHcvf8e2aboe7JpTaTKTI41Fe/edit?usp=sharing&ouid=108181189655370107821&rtpof=true&sd=true"
            },
        ]
    }

]


winners.map(v => document.querySelector('#winners').innerHTML +=
    `<div>
                <img src="${v.img}" alt="" title="">
                <div>
                    <h5 class="display-5">
                        <b>${v.title}</b>
                    </h5>
                    <p class="display-7">${v.text}</p>
                </div>
            </div>`)



reviews.map(v => document.querySelector('#reviews').innerHTML += `
<div class="item-wrapper"><p class="display-7">${v.text}</p>
                    <div class="img-wrapper">
                        <img src="${v.img}" alt="">
                    </div>
                    <h5 class="display-7">
                        <b>${v.name}</b>
                    </h5>
                </div>`)

Study_Materials.map(v => document.querySelector("#study_materials").innerHTML +=
    `<a href="${v.link}">
                <h2><b> ${v.text} </b></h2>
            </a>`)

Scenarios.map((v, i) => {

    let subcontent = ''
    v.content.map(v1 => {
        subcontent += `<a href="${v1.link}">
                        <div class="infoicon">
                                <img src="assets/svg/screpka.svg" class="icon">
                            <p class="hrefText"> ${v1.name} </p>
                        </div>
                    </a>`})

    document.querySelector('#bootstrap-accordion_2').innerHTML +=
        `<div class="card">
                    <div class="card-header" id="headingOne">
                        <a role="button" class="panel-title" data-bs-toggle="collapse"
                            href="#collapse${i + 1}_2" >
                            <h6 class="panel-title-edit mbr-semibold mbr-fonts-style mb-0 display-5">${v.name} </h6>
                            <span class="sign mbr-iconfont mobi-mbri-arrow-down"></span>
                        </a>
                    </div>
                    <div id="collapse${i + 1}_2" class="panel-collapse collapse">
{{subcontent}}
                    </div>
                </div>`.replace('{{subcontent}}', subcontent)

})
document.addEventListener('DOMContentLoaded', function () {
    const toggleButton = document.getElementById('toggleButton');
    const sideMenu = document.getElementById('sideMenu');
    const overlay = document.createElement('div');
    overlay.classList.add('overlay');
    document.body.appendChild(overlay);

    // Открытие/закрытие меню по клику на кнопку
    toggleButton.addEventListener('click', function (event) {
        event.stopPropagation(); // Предотвращаем всплытие, чтобы не закрыть меню сразу
        sideMenu.classList.toggle('open');
        overlay.classList.toggle('active');
    });

    // Закрытие меню по клику вне его зоны
    overlay.addEventListener('click', function () {
        sideMenu.classList.remove('open');
        overlay.classList.remove('active');
    });

    // Закрытие меню при клике на ссылку (опционально)
    sideMenu.querySelectorAll('a').forEach(link => {
        link.addEventListener('click', function () {
            sideMenu.classList.remove('open');
            overlay.classList.remove('active');
        });
    });
});
